cask_args appdir: '/Applications'

# Should have this already
# tap 'homebrew/bundle'
# tap 'caskroom/cask'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'ssh-copy-id'
brew 'wget'

# File compressor
brew 'p7zip'
brew 'pigz'
brew 'zopfli'

# Install more recent versions of some macOS tools.
brew 'bash'
brew 'bash-completion@2'
brew 'vim'
brew 'python'
brew 'grep'
brew 'gnu-sed'
brew 'openssl'
brew 'openssh'
brew 'screen'

# Cool stuff
# brew 'ack'
brew 'grc'
brew 'youtube-dl'
brew 'ffmpeg'

# Image stuff
# brew 'imagemagick'
# brew 'jp2a'
# brew 'jq'
# brew 'libcaca', args: ['with-imlib2']

brew 'git'
# brew 'git-lfs'
brew 'hub'
# brew 'libgit2'
# brew 'readline'
# brew 'rbenv'
# brew 'pyenv'
# brew 'spaceman-diff'
# brew 'spark'
# brew 'unrar'

# Install Casks
cask 'visual-studio-code'
cask 'sequel-pro'
cask 'android-file-transfer'
cask 'android-studio'
cask 'arduino'
cask 'github'

#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
#cask 'vagrant'

cask 'alfred'
cask 'caffeine'
cask 'coconutbattery'
cask 'dropbox'
cask 'macs-fan-control'
cask 'mounty'
cask 'google-chrome'
cask 'handbrake'
cask 'steam'
cask 'tunnelbear'
cask 'vlc'
cask 'transmission'
cask 'the-unarchiver'
