cask_args appdir: '/Applications'

#tap 'homebrew/bundle'
#tap 'caskroom/cask'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'ssh-copy-id'
brew 'wget'

# Install more recent versions of some macOS tools.
brew 'bash'
brew 'vim'
brew 'grep'
brew 'openssh'
brew 'screen'

brew 'ack'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'postgresql'
brew 'puma/puma/puma-dev'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'unrar'
brew 'yarn'
brew 'youtube-dl'

# Install Casks
cask 'atom'
cask 'visual-studio-code'
cask 'sequel-pro'
cask 'android-file-transfer'
cask 'android-studio'
cask 'arduino'
cask 'github-desktop'

cask 'virtualbox'
cask 'vargant'

cask 'archiver'
cask 'alfred'
cask 'caffeine'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'handbrake'
cask 'seashore'
cask 'steam'
cask 'transmission-remote-gtk'
cask 'tunnelbear'
cask 'vlc'