cask_args appdir: '/Applications'

# Should have this already
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "coreutils"
brew "moreutils"
brew "findutils"
brew "ssh-copy-id", link: true
brew "wget"

## File compressor
brew "p7zip"
brew "pigz"
# brew "zopfli"
brew "unrar"

## Install more recent versions of some macOS tools.
brew "bash"
brew "bash-completion@2", link: false
brew "python3"
brew "grep"
# brew "gnu-sed"
brew "openssl"
brew "openssh"
brew "screen"

## Cool stuff
# brew "ack"
brew "grc"

## AV tools
# brew "mkvtoolnix"
# brew "youtube-dl"
# brew "ffmpeg"

## Image stuff
# brew "imagemagick"
# brew "jp2a"

## Dev
# brew "mitmproxy"
# brew "mitmweb"
brew 'git'
# brew 'git-lfs'
# brew 'hub'

# brew 'libgit2'
# brew 'readline'
# brew 'rbenv'
# brew 'pyenv'
# brew 'spaceman-diff'
# brew 'spark'

# Install Casks
# cask "arduino"
# cask "android-file-transfer"
cask "android-studio"
cask "visual-studio-code"
# cask "etrecheckpro"
# cask "sequel-pro"
# cask "github-desktop"

# cask "virtualbox"
# cask "virtualbox-extension-pack"
# cask "vagrant"
cask "docker"

cask "alfred"
cask "balenaetcher"
# cask "bitbar"
# cask "caffeine"
cask "coconutbattery"
cask "dropbox"
cask "gswitch"
# cask "macs-fan-control"
# cask "mounty"
cask "paparazzi"
cask "gimp"
cask "google-chrome"
cask "handbrake"
cask "sourcetree"
cask "syncthing"
cask "timemachineeditor"
cask "transmission"
cask "tunnelbear"
cask "turbo-boost-switcher"
cask "vlc"
cask "the-unarchiver"

## Games
cask "openemu"
# cask "steam"
